leetcode_726_number_of_atoms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 726. Number of Atoms</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 726. Number of Atoms</h1>
<ul class="org-ul">
<li><a href="mistake_missing_edge_case.html#ID-29B5FD8A-98FD-48CE-8C30-04671E44AD27">Mistake: Missing edge case</a>: <code>(A)2(B)2</code>.</li>

<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a>  The difficult of the problem comes from implementing a parser which you can break-down on <code>read_atom</code>, <code>read_int</code> and <code>parse</code>.  Time complexity is \(O(n^2)\) and space \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countOfAtoms</span>(<span style="font-weight: bold;">self</span>, formula: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">str</span>:
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">read_atom</span>(i):
            <span style="font-weight: bold;">assert</span> formula[i].isalpha()
            j = i + 1
            <span style="font-weight: bold;">while</span> j &lt; <span style="font-weight: bold;">len</span>(formula) <span style="font-weight: bold;">and</span> <span style="font-style: italic;">"a"</span> &lt;= formula[j] &lt;= <span style="font-style: italic;">"z"</span>:
                <span style="font-weight: bold; font-style: italic;">j</span> += 1
            <span style="font-weight: bold; font-style: italic;">atom</span> = formula[<span style="font-weight: bold; font-style: italic;">i</span>:j]
            <span style="font-weight: bold; font-style: italic;">k</span>, <span style="font-weight: bold; font-style: italic;">count</span> = read_int(j)
            <span style="font-weight: bold;">return</span> k, atom, count

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">read_int</span>(i):
            <span style="font-weight: bold; font-style: italic;">j</span> = i
            <span style="font-weight: bold;">while</span> j &lt; <span style="font-weight: bold;">len</span>(formula) <span style="font-weight: bold;">and</span> <span style="font-style: italic;">"0"</span> &lt;= formula[j] &lt;= <span style="font-style: italic;">"9"</span>:
                <span style="font-weight: bold; font-style: italic;">j</span> += 1
            <span style="font-weight: bold;">return</span> j, 1 <span style="font-weight: bold;">if</span> i == j <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">int</span>(formula[i:j])

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">parse</span>(i, atoms):
            <span style="font-weight: bold;">if</span> i == <span style="font-weight: bold;">len</span>(formula) <span style="font-weight: bold;">or</span> formula[i] == <span style="font-style: italic;">")"</span>:
                <span style="font-weight: bold;">return</span> i, atoms
            <span style="font-weight: bold;">elif</span> formula[i] == <span style="font-style: italic;">"("</span>:
                <span style="font-weight: bold; font-style: italic;">j</span>, <span style="font-weight: bold; font-style: italic;">new_atoms</span> = parse(i + 1, {})
                <span style="font-weight: bold; font-style: italic;">k</span>, <span style="font-weight: bold; font-style: italic;">count</span> = read_int(j + 1)
                <span style="font-weight: bold;">for</span> atom <span style="font-weight: bold;">in</span> new_atoms:
                    atoms.setdefault(atom, 0)
                    atoms[atom] += new_atoms[atom] * count
                <span style="font-weight: bold;">return</span> parse(k, atoms)
            <span style="font-weight: bold;">elif</span> formula[i].isalpha():
                <span style="font-weight: bold; font-style: italic;">j</span>, <span style="font-weight: bold; font-style: italic;">atom</span>, <span style="font-weight: bold; font-style: italic;">count</span> = read_atom(i)
                atoms.setdefault(atom, 0)
                atoms[atom] += count
                <span style="font-weight: bold;">return</span> parse(j, atoms)

        ans = <span style="font-style: italic;">""</span>
        <span style="font-weight: bold;">for</span> atom, count <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(parse(0, {})[1].items()):
            ans += atom
            <span style="font-weight: bold;">if</span> count &gt; 1:
                ans += <span style="font-weight: bold;">str</span>(count)
        <span style="font-weight: bold;">return</span> ans

<span style="font-weight: bold;">assert</span> Solution().countOfAtoms(<span style="font-style: italic;">"H2O"</span>) == <span style="font-style: italic;">"H2O"</span>
<span style="font-weight: bold;">assert</span> Solution().countOfAtoms(<span style="font-style: italic;">"Mg(OH)2"</span>) == <span style="font-style: italic;">"H2MgO2"</span>
<span style="font-weight: bold;">assert</span> Solution().countOfAtoms(<span style="font-style: italic;">"K4(ON(SO3)2)2"</span>) == <span style="font-style: italic;">"K4N2O14S4"</span>
<span style="font-weight: bold;">assert</span> Solution().countOfAtoms(<span style="font-style: italic;">"(A)2(B)2"</span>) == <span style="font-style: italic;">"A2B2"</span>
</pre>
</div>
</div>
</body>
</html>